app/views/trips/new.html.haml

				%li= label_tag(:car_id, "Car Type:")
				%li= select_tag(:car_id, options_for_select(Car.select), prompt: "Select a size")
---
SELECT "cars".* FROM "cars"

			%ul.question
				%li= select_tag(:flight_id, options_for_select(Flight.select), prompt: "Origin of Flight")
---
SELECT "flights".* FROM "flights"