app/views/events/index.html.haml

      = form_tag events_path, method: 'get' do
        = collection_select(:event, :name, Event.order(:id), :id, :name, {:prompt => "Select an Event", :multiple => true }, {:class => "dropdown"})
---
SELECT "events".* FROM "events"   ORDER BY "events"."id" ASC