app/controllers/events_controller.rb

SELECT "events".* FROM "events"   ORDER BY "events"."id" ASC
---
  def index
    # @events = Event.all
    if params[:event].present?

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "trips"  WHERE "trips"."event_id" = $1  [["event_id", 2]]
SELECT COUNT(*) FROM "pledges"  WHERE "pledges"."event_id" = $1  [["event_id", 2]]
---
  def show
    @event = Event.find(params[:id])
    @total_trips = @event.trips.count
    @total_carbon = @event.total(:carbon)
    @total_km = @event.total(:km_travelled)
    # @total_trees = @event.total_trees
    @total_pledge = @event.pledges.count