app/controllers/trees_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @tree = Tree.new
    @rand_amount = params[:rand_amount]
    @conversion = params[:conversion]
    @dollar_amount = params[:dollar_amount]
    @event = Event.find(params[:event_id])

INSERT INTO "trees" ("created_at", "event_id", "rand_given", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-08-19 09:12:50.708689"], ["event_id", 2], ["rand_given", 271], ["updated_at", "2015-08-19 09:12:50.708689"], ["user_id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
  def create
    @tree = Tree.create(tree_params.merge({user_id: session[:user_id], event_id: @event.id}))

    @user = User.find(@tree.user_id)
    @event = Event.find(@tree.event_id)