app/controllers/trips_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "trips" ("created_at", "event_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-08-19 08:03:07.469354"], ["event_id", 2], ["updated_at", "2015-08-19 08:03:07.469354"], ["user_id", 2]]
UPDATE "trips" SET "carbon" = $1, "km_travelled" = $2, "updated_at" = $3 WHERE "trips"."id" = 7  [["carbon", 2260], ["km_travelled", 10000], ["updated_at", "2015-08-19 08:03:07.583296"]]
---
  def create
    @event = Event.find(params[:event_id])
    @trip = Trip.create(user_id: @user.id, event_id: @event.id)
    @trip.set_carbon_and_km(params)
    @money_amount = (@trip.carbon * 120 / 1000).round
    @conversion_rate = JSON.load(RestClient.get("http://api.fixer.io/latest?base=USD"))["rates"]["ZAR"]
    @dollar_amount = "USD $" + (@money_amount/@conversion_rate).round(2).to_s

    @session = Session.create(user_id: @user.id, event_name: @event.name)
    @session.total_carbon = @trip.carbon
    @session.car_carbon = @trip.car_carbon
    @session.plane_carbon = @trip.flight_carbon
    @session.bus_carbon = @trip.bus_carbon
    @session.train_carbon = @trip.train_carbon
    @session.km_travelled = @trip.km_travelled
    @session.email = @user.email
    @session.name = @user.name
    @session.surname = @user.surname
    @session.first_session = @user.created_at
    @session.save

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_event
    @event = Event.find(params[:event_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
  def set_user
    @user = User.find(session[:user_id])