app/controllers/users_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
      @event = Event.find(params[:event_id])

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'j@user.com' LIMIT 1
UPDATE "users" SET "event_id" = $1, "updated_at" = $2 WHERE "users"."id" = 2  [["event_id", 2], ["updated_at", "2015-08-19 08:02:58.364681"]]
---
  def create
    @event = Event.find(params[:event_id])
    @user = User.find_by(email: user_params[:email])
    unless @user
      @user = User.create(user_params)
    end
    session[:user_id] = @user.id
    @user.event_id = @event.id
    @user.save